# Домашнее задание №3
Группа: РИМ-150950

ФИО: Эрмиш Александр Александрович

### Задание 1
- Создание объект Series из словаря, где ключи - имена городов, а значения - населения этих городов. Выведите этот Series.
- Создайте DataFrame из двух списков одинаковой длины, преобразовав его к DataFrame и
добавив собственные названия столбцов. Посмотрите на индексы и названия столбцов.
- Используя созданный DataFrame , выведите его методами df.info(), df.shape и
df.describe()

In [111]:
import pandas as pd
import numpy as np

In [6]:
# Создадим словарь, где ключи - имена городов, а значения - население этих городов
cities_population = {
    'Москва': 13149000,
    'Санкт-Петербург': 5598000,
    'Новосибирск': 1634000,
    'Екатеринбург': 1539000,
    'Казань': 1319000,
    'Нижний Новгород': 1241000,
    'Красноярск': 1204000,
    'Челябинск': 1183000,
    'Самара': 1164000,
    'Ростов-на-Дону': 1140000,
    'Уфа': 1130000,
    'Омск': 1110000,
    'Краснодар': 1100000,
    'Воронеж': 1058000,
    'Пермь': 1028000,
    'Волгоград': 1004000
}

# Создадим и выведем объект Series из словаря cities_population
cities_series = pd.Series(cities_population)
cities_series

Москва             13149000
Санкт-Петербург     5598000
Новосибирск         1634000
Екатеринбург        1539000
Казань              1319000
Нижний Новгород     1241000
Красноярск          1204000
Челябинск           1183000
Самара              1164000
Ростов-на-Дону      1140000
Уфа                 1130000
Омск                1110000
Краснодар           1100000
Воронеж             1058000
Пермь               1028000
Волгоград           1004000
dtype: int64

In [7]:
# Создадим два списка одинаковой длины (список имен и список возрастов)
names = ['Алексей', 'Мария', 'Дмитрий', 'Елена', 'Сергей']
ages = [25, 30, 35, 28, 40]

# Преобразуем в DataFrame
df = pd.DataFrame({
    'Имя': names, 
    'Возраст': ages
})

df

       Имя  Возраст
0  Алексей       25
1    Мария       30
2  Дмитрий       35
3    Елена       28
4   Сергей       40

In [10]:
# Выведем отдельно индексы и названия столбцов датафрейма
print(f"Индексы: {df.index.tolist()}")
print(f"Названия столбцов: {df.columns.tolist()}\n")

Индексы: [0, 1, 2, 3, 4]
Названия столбцов: ['Имя', 'Возраст']

Выведем информацию о датафрейме с помощью методов info(), shape и describe()

In [14]:
# Общая информация о датафрейме (типы данных, количество непустых значений и т.д.)
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 2 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   Имя      5 non-null      object
 1   Возраст  5 non-null      int64
dtypes: int64(1), object(1)
memory usage: 208.0+ bytes

In [15]:
# Размерность DataFrame (количество строк, столбцов)
df.shape

(5, 2)

In [16]:
# Статистические характеристики числовых столбцов
df.describe()

        Возраст
count   5.00000
mean   31.60000
std     5.94138
min    25.00000
25%    28.00000
50%    30.00000
75%    35.00000
max    40.00000

### Задание 2

```python
csv_data = """Name,Score,Passed
Alice,85,True
Bob,90,False
Charlie,78,True
Soul,12,False
David,100,True
Lisa,66,False
"""
```
- Сохраните приведенный выше CSV в файл data.csv . Используя pd.read_csv() , загрузите его в
DataFrame и выведите первые 3 строки.
- Создайте простой JSON-файл (например, со списком товаров и их цен). Считайте его с помощью
pd.read_json и выведите содержимое.
- Создайте SQLite базу данных и таблицу через sqlite3 , заполните её несколькими строками и
извлеките их с помощью pd.read_sql().
- Попробуйте прочитать HTML-таблицу с сайта: найдите URL с таблицей (например, какой-нибудь
список) и примените pd.read_html().

In [17]:
import pandas as pd
import sqlite3
from io import StringIO
import json

In [18]:
# Создадим файл csv
csv_data = """Name,Score,Passed
Alice,85,True
Bob,90,False
Charlie,78,True
Soul,12,False
David,100,True
Lisa,66,False
"""

with open('data.csv', 'w', encoding='utf-8') as f:
    f.write(csv_data)

In [19]:
# Загрузим созданный файл csv в DataFrame и выведем его первые 3 строки
df_csv = pd.read_csv('data.csv')

df_csv.head(3)

      Name  Score  Passed
0    Alice     85    True
1      Bob     90   False
2  Charlie     78    True

In [21]:
# Создадим json-файл со списком товаров и их ценами
products_data = [
    {"product": "яблоко", "price": 50},
    {"product": "банан", "price": 30},
    {"product": "апельсин", "price": 40},
    {"product": "груша", "price": 60}
]

with open('products.json', 'w', encoding='utf-8') as f:
    json.dump(products_data, f, ensure_ascii=False, indent=2)

In [22]:
# Загрузим созданный файл json-файл в DataFrame и выведем его содержимое
df_json = pd.read_json('products.json')

df_json

    product  price
0    яблоко     50
1     банан     30
2  апельсин     40
3     груша     60

In [23]:
# Создадим подключение к базе данных SQLite
conn = sqlite3.connect(':memory:')

In [24]:
# Создадим таблицу
cursor = conn.cursor()
cursor.execute('''
CREATE TABLE employees (
    id INTEGER PRIMARY KEY,
    name TEXT,
    department TEXT,
    salary INTEGER
)
''')

In [25]:
# Заполним таблицу данными
employees_data = [
    (1, 'Анна', 'IT', 70000),
    (2, 'Борис', 'HR', 50000),
    (3, 'Виктория', 'IT', 80000),
    (4, 'Галина', 'Finance', 60000),
    (5, 'Дмитрий', 'HR', 55000)
]

cursor.executemany('INSERT INTO employees VALUES (?, ?, ?, ?)', employees_data)

In [27]:
# Прочитаем данные из таблицы с помощью pandas
df_sql = pd.read_sql_query('SELECT * FROM employees', conn)
print("Данные из SQLite базы данных:")

df_sql

Данные из SQLite базы данных:

   id      name department  salary
0   1      Анна         IT   70000
1   2     Борис         HR   50000
2   3  Виктория         IT   80000
3   4    Галина    Finance   60000
4   5   Дмитрий         HR   55000

In [28]:
# Закроем соединение
conn.close()

In [64]:
# URL таблицы курсов валют ЦБ РФ
url = "https://www.cbr.ru/currency_base/daily/"

# Прочитаем все таблицы со страницы
tables = pd.read_html(url)

# Вывод количества найденных таблиц
print(f"Найдено таблиц: {len(tables)}")

# Выведем первую таблицу на страницу
df = tables[0]
df.head()

Найдено таблиц: 1

   Цифр. код Букв. код  Единиц                 Валюта    Курс
0         36       AUD       1   Австралийский доллар  531079
1        944       AZN       1  Азербайджанский манат  468998
2         12       DZD     100      Алжирских динаров  615323
3         51       AMD     100       Армянских драмов  208842
4        764       THB      10                  Батов  251878

### Задание 3

```python
df = pd.DataFrame({
'Name': ['Alice','Bob','Charlie','David','Eva'],
'Age': [25, 30, 35, 40, 22],
'Score': [88, 92, 85, 90, 95]
})

df2 = pd.DataFrame({
'Dept': ['HR','HR','IT','IT','HR'],
'Salary': [100, 150, 200, 250, 180]
})
```

- Отфильтруйте df из примера по условию: Age > 30 и Score >= 90.
- Создайте DataFrame с покупками (столбцы: User , Item , Quantity ), затем посчитайте общее
количество покупок по каждому User с помощью groupby().
- Отсортируйте один из ваших DataFrame по нескольким столбцам (например, сначала по
Department , потом по Salary ).
- Используя groupby() , найдите средний возраст студентов в каждом классе (придумайте данные с
классами).

In [75]:
# Создадим датафреймы
df = pd.DataFrame({
    'Name': ['Alice','Bob','Charlie','David','Eva'],
    'Age': [25, 30, 35, 40, 22],
    'Score': [88, 92, 85, 90, 95]
})

df

      Name  Age  Score
0    Alice   25     88
1      Bob   30     92
2  Charlie   35     85
3    David   40     90
4      Eva   22     95

In [76]:
df2 = pd.DataFrame({
    'Dept': ['HR','HR','IT','IT','HR'],
    'Salary': [100, 150, 200, 250, 180]
})

df2

  Dept  Salary
0   HR     100
1   HR     150
2   IT     200
3   IT     250
4   HR     180

In [71]:
# Отфильтруем записи в df по условию Age > 30 и Score >= 90
filtered_df = df[(df['Age'] > 30) & (df['Score'] >= 90)]
filtered_df

    Name  Age  Score
3  David   40     90

In [ ]:
# Cозданим DataFrame с покупками

purchases_df = pd.DataFrame({
    'User': ['Иван', 'Мария', 'Иван', 'Петр', 'Мария', 'Иван', 'Анна', 'Петр'],
    'Item': ['яблоко', 'банан', 'апельсин', 'яблоко', 'груша', 'банан', 'яблоко', 'апельсин'],
    'Quantity': [2, 3, 1, 4, 2, 2, 3, 1]
})

purchases_df

    User      Item  Quantity
0   Иван    яблоко         2
1  Мария     банан         3
2   Иван  апельсин         1
3   Петр    яблоко         4
4  Мария     груша         2
5   Иван     банан         2
6   Анна    яблоко         3
7   Петр  апельсин         1

In [85]:
# Подсчитаем количество товаров по каждому пользователю
user_purchases = purchases_df.groupby('User')['Quantity'].sum().to_frame()
user_purchases

       Quantity
User
Анна          3
Иван          5
Мария         5
Петр          5

In [90]:
# Отсортируем df2 по Dept и Salary по возрастанию
sorted_df2 = df2.sort_values(['Dept', 'Salary'], ascending=[True, True])

sorted_df2

  Dept  Salary
0   HR     100
1   HR     150
4   HR     180
2   IT     200
3   IT     250

In [109]:
# Создадим датафрейм с данными об возрастах студентов из разных классов
students_df = pd.DataFrame({
    'Student': ['Анна', 'Борис', 'Виктория', 'Георгий', 'Дарья', 'Евгений', 'Жанна', 'Захар'],
    'Age': [16, 17, 16, 18, 16, 16, 18, 17],
    'Class': ['10A', '10Б', '10A', '11A', '10Б', '11A', '10A', '11Б']
})

students_df

    Student  Age Class
0      Анна   16   10A
1     Борис   17   10Б
2  Виктория   16   10A
3   Георгий   18   11A
4     Дарья   16   10Б
5   Евгений   16   11A
6     Жанна   18   10A
7     Захар   17   11Б

In [108]:
# Вычислим средний возраст студентов в каждом классе
avg_age_by_class = students_df.groupby('Class')['Age'].mean().to_frame()

avg_age_by_class

             Age
Class
10A    16.666667
10Б    16.500000
11A    17.000000
11Б    17.000000

### Задание 4

- В вашем DataFrame найдите количество пропущенных значений в каждом столбце (используйте
df.isna().sum()).
- Удалите все строки, где присутствуют пропуски во всех столбцах одновременно.
- Создайте столбец с датами в строковом формате (например, `df['date_str'] =
['2023-01-01', ...]` ), затем преобразуйте его в datetime и извлеките из него год и месяц.
- Приведите числовой столбец с плавающей точкой к целочисленному типу, а строковый столбец с
числами – к числовому типу с помощью pd.to_numeric()

In [116]:
# Создаем DataFrame с пропущенными значениями для демонстрации
df_with_na = pd.DataFrame({
    'Name': ['Alice', 'Bob', 'Charlie', 'David', 'Eva', np.nan],
    'Age': [25, np.nan, 35, 40, 22, np.nan],
    'Score': [88, 92, np.nan, 90, 95, np.nan],
    'Grade': [np.nan, 'B', 'C', 'A', 'A', np.nan]
})

df_with_na

      Name   Age  Score Grade
0    Alice  25.0   88.0   NaN
1      Bob   NaN   92.0     B
2  Charlie  35.0    NaN     C
3    David  40.0   90.0     A
4      Eva  22.0   95.0     A
5      NaN   NaN    NaN   NaN

In [117]:
# Нахождение количества пропущенных значений в каждом столбце
missing_values = df_with_na.isna().sum()

missing_values

Name     1
Age      2
Score    2
Grade    2
dtype: int64

In [120]:
# Удаляем строки, где все значения NaN
df_cleaned = df_with_na.dropna(how='all')

df_cleaned

      Name   Age  Score Grade
0    Alice  25.0   88.0   NaN
1      Bob   NaN   92.0     B
2  Charlie  35.0    NaN     C
3    David  40.0   90.0     A
4      Eva  22.0   95.0     A

In [122]:
# Преобразование строкового столбца с датами в datetime и извлечение года и месяца
dates_df = pd.DataFrame({
    'date_str': ['2023-01-15', '2023-02-20', '2023-03-10', '2023-04-05', '2023-05-12']
})

dates_df

     date_str
0  2023-01-15
1  2023-02-20
2  2023-03-10
3  2023-04-05
4  2023-05-12

In [123]:
# Преобразуем строковый столбец в формат datetime
dates_df['date_datetime'] = pd.to_datetime(dates_df['date_str'])

dates_df

     date_str date_datetime
0  2023-01-15    2023-01-15
1  2023-02-20    2023-02-20
2  2023-03-10    2023-03-10
3  2023-04-05    2023-04-05
4  2023-05-12    2023-05-12

In [124]:
dates_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 2 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   date_str       5 non-null      object
 1   date_datetime  5 non-null      datetime64[ns]
dtypes: datetime64[ns](1), object(1)
memory usage: 208.0+ bytes

In [126]:
# Извлекаем год и месяц
dates_df['year'] = dates_df['date_datetime'].dt.year
dates_df['month'] = dates_df['date_datetime'].dt.month

dates_df

     date_str date_datetime  year  month
0  2023-01-15    2023-01-15  2023      1
1  2023-02-20    2023-02-20  2023      2
2  2023-03-10    2023-03-10  2023      3
3  2023-04-05    2023-04-05  2023      4
4  2023-05-12    2023-05-12  2023      5

In [ ]:
# Преобразование типов данных
types_df = pd.DataFrame({
    'float_col': [1.5, 2.7, 3.9, 4.2, 5.8],  # Столбец с плавающей точкой
    'str_num_col': ['10', '20', '30', '40', '50']  # Столбец со строками, содержащими числа
})

types_df

   float_col str_num_col
0        1.5          10
1        2.7          20
2        3.9          30
3        4.2          40
4        5.8          50

In [ ]:
# Типы данных
types_df.dtypes

float_col      float64
str_num_col     object
dtype: object

In [129]:
# Преобразуем столбец с плавающей точкой к целочисленному типу
types_df['int_col'] = types_df['float_col'].astype(int)

# Преобразуем строковый столбец с числами к числовому типу с помощью pd.to_numeric()
types_df['numeric_col'] = pd.to_numeric(types_df['str_num_col'])

types_df

   float_col str_num_col  int_col  numeric_col
0        1.5          10        1           10
1        2.7          20        2           20
2        3.9          30        3           30
3        4.2          40        4           40
4        5.8          50        5           50

In [130]:
# Типы данных
types_df.dtypes

float_col      float64
str_num_col     object
int_col          int64
numeric_col      int64
dtype: object